[
  {
    "year": "2025",
    "title": "이야기로 연결되는 교육, 함께 걷는 여정",
    "text": "2025년은 저에게 '연결과 공유'의 해입니다. 웹툰 <숨결 이야기>를 통해 교육 현장의 따뜻한 순간들을 그림으로 나누고, 팟캐스트 <함께 걷는 배움>으로 선생님들의 진솔한 이야기를 세상에 전하고 있습니다. 교육이 단순히 지식을 전달하는 것이 아니라, 서로의 이야기를 나누며 함께 성장하는 과정이라는 것을 더욱 깊이 체감하고 있습니다. 특히 방과후 기록 시스템을 직접 설계하면서 선생님들의 소중한 노력이 데이터로 축적되어 다시 아이들에게 환원될 수 있는 지속 가능한 교육 생태계를 구축하고 있습니다. 그리고 HamsungEdu Blog에서는 대안교육 현장에서 마주하는 고민들을 에세이로 풀어내며, 개인적 성찰을 넘어 함께 나누는 통찰이 되도록 노력하고 있습니다.",
    "links": [
      {
        "label": "기획안 PDF",
        "url": "./assets/2025/함께걷는배움 기획.pdf"
      },
      {
        "label": "Afterschool 기록시스템",
        "url": "https://afterschool-slow.netlify.app"
      },
      {
        "label": "홍보 프로세스.pdf",
        "url": "./assets/2025/홍보 프로세스.pdf"
      },
      {
        "label": "후원 네트워크 운영.pdf",
        "url": "./assets/2025/후원 네트워크 운영 프로세스.pdf"
      },
      {
        "label": "YouTube",
        "url": "https://www.youtube.com/@hamsungedu"
      },
      {
        "label": "Instagram",
        "url": "https://www.instagram.com/hamsungedu"
      },
      {
        "label": "HamsungEdu Blog (교육 에세이)",
        "url": "https://hamsungedu.blogspot.com/"
      }
    ]
  },
  {
    "year": "2024",
    "title": "더 넓은 세상에서 바라본 교육의 가능성",
    "text": "주식회사 세상이음에서 교육연구원으로 활동하며 새로운 차원의 교육 경험을 쌓고 있습니다. 한 교실에서 아이들과 만나던 미시적 경험에서 한 걸음 더 나아가, 교육 플랫폼을 설계하고 실제 수업에서 활용할 수 있는 도구들을 개발하고 있습니다. '어떻게 하면 더 많은 선생님들이, 더 많은 아이들과 의미 있는 만남을 가질 수 있을까' 하는 고민이 구체적인 결과물로 구현되고 있습니다. 이 과정에서 제 교육 철학도 더욱 명확해졌습니다. 교육은 고립된 개인의 노력이 아니라 협력적 생태계 안에서 이루어지는 것이며, 작은 도구 하나라도 누군가의 수업을 더 풍성하게 만들 수 있다는 것을 매일 확인하고 있습니다.",
    "links": [
      {
        "label": "경제교육 리뉴얼",
        "url": "./assets/2024/경제교육 리뉴얼.pdf"
      },
      {
        "label": "교과통합수업(국어+마음공부)",
        "url": "./assets/2024/교과통합수업(국어+마음공부).pdf"
      },
      {
        "label": "대안교사양성과정 결과",
        "url": "./assets/2024/대안교사양성과정 결과.pdf"
      },
      {
        "label": "교사 주체성 회복",
        "url": "./assets/2024/대안교육 현장 속 교사들의 행위주체성 회복하기.pdf"
      }
    ]
  },
  {
    "year": "2023",
    "title": "마음을 읽는 눈, 함께 성장하는 손",
    "text": "삶을 위한 교사대학을 수료하고 임상심리사 자격을 취득하면서 중요한 깨달음을 얻었습니다. 교사의 역할이 단순히 수업 진행에서 끝나는 것이 아니라, 학생들의 내면을 깊이 이해하고 함께 성장해나가는 것이라는 점입니다. 교과 통합 수업을 시도하고 경제 교육 자료를 제작하면서도, 개인적 작업이 아닌 동료 교사들과의 협력적 성장이 얼마나 중요한지 실감했습니다. 이 해는 '개인' 중심에서 '공동체' 중심으로 교육관이 확장된 의미 있는 전환점이었습니다.",
    "links": [
      {
        "label": "경제교재 단계별 교육내용",
        "url": "./assets/2023/경제교재 단계별 교육내용.pdf"
      },
      {
        "label": "교과통합수업(국어+영어)",
        "url": "./assets/2023/교과통합수업(국어+영어).pdf"
      },
      {
        "label": "임상심리사 2급 자격증",
        "url": "./assets/2023/자격증_임상심리사(2급).pdf"
      },
      {
        "label": "함께하는강사되기",
        "url": "./assets/2023/함께하는강사되기.pdf"
      }
    ]
  },
  {
    "year": "2022",
    "title": "더 깊이, 더 가까이 다가가기 위한 준비",
    "text": "웹디자인기능사와 느린학습자 인지상담사 자격을 취득한 동기는 명확했습니다. '더 깊이 이해하고, 더 효과적으로 소통하고 싶다'는 열망 때문이었습니다. 말로만 설명하는 것을 넘어 실제로 구현할 수 있는 도구를 만들고 싶었고, 학습에 어려움을 겪는 학생들의 마음을 진정으로 이해하고 싶었습니다. 이 시기부터 교육 실무자로서 '실제적 도구'의 힘을 믿고 활용하기 시작했습니다.",
    "links": [
      {
        "label": "느린학습자 자격등록 점검사항",
        "url": "./assets/2022/기획_느린학습자(경계선) 관련 민간자격등록 점검사항.pdf"
      },
      {
        "label": "느린학습자 상담사 자격증",
        "url": "./assets/2022/자격증_느린학습자(경계선) 인지학습 상담사.pdf"
      },
      {
        "label": "웹디자인기능사 자격증",
        "url": "./assets/2022/자격증_웹디자인기능사.pdf"
      }
    ]
  },
  {
    "year": "2021",
    "title": "방향을 모색하며 새로운 가능성을 발견한 해",
    "text": "로스쿨 입시를 준비하면서 '법과 교육의 접점'에 대해 깊이 고민했습니다. 1단계 합격과 면접 경험을 통해 제 진로 방향성을 다시 한 번 성찰하는 귀중한 시간을 가졌습니다. 또한 연말에 게더타운을 활용한 메타버스 축제를 기획하면서 기술과 교육이 만날 수 있는 새로운 가능성을 발견했습니다. 이는  훗날 디지털 도구를 활용한 교육 혁신에 대한 관심으로 이어졌습니다.",
    "links": [
      {
        "label": "게더타운 기획",
        "url": "./assets/2021/도전_게더타운.pdf"
      },
      {
        "label": "로스쿨 준비자료",
        "url": "./assets/2021/도전_로스쿨.pdf"
      }
    ]
  },
  {
    "year": "2020",
    "title": "삶 속 배움을 위한 교재·교구 개발",
    "text": "코로나19로 대면 활동이 제한된 상황에서 교육교재의 중요성을 절실히 깨달았습니다. 먹는 일, 씻는 일, 그리고 경제 부루마블까지 학생들의 삶에 직접적으로 닿아 있는 교재와 교구를 직접 제작하며 '삶 속 배움'을 실현하기 위한 기초를 다졌습니다. 이는 교육이 실생활과 분리될 수 없다는 제 교육 철학을 구체적으로 구현한 결과물이었습니다.",
    "links": [
      {
        "label": "교재연구개발: 먹는일_씻는일",
        "url": "./assets/2020/01_교재연구개발_먹는일_씻는일.pdf"
      },
      {
        "label": "교구개발: 경제깨움 부루마블",
        "url": "./assets/2020/02_교구개발_경제깨움 부루마블.pdf"
      }
    ]
  },
  {
    "year": "2019",
    "title": "복잡한 현실 속에서 키운 문제 해결 역량",
    "text": "교육 현장의 복잡하고 다층적인 문제들과 직면하면서 실질적인 문제 해결 능력을 키웠습니다. 단순히 문제를 인식하는 것을 넘어, 현실적이고 지속 가능한 해결책을 찾아 실제로 적용하는 경험을 쌓았습니다. 이 시기의 경험은 훗날 시스템적 사고와 실용적 접근법을 기르는 밑거름이 되었습니다.",
    "links": []
  },
  {
    "year": "2018",
    "title": "교육 패러다임의 확장과 새로운 시야",
    "text": "기존의 교육 방식을 넘어 다양한 교육 모델과 접근법을 탐색한 해였습니다. 전통적인 교육 틀에서 벗어나 학습자 중심의 교육, 경험 기반 교육 등 새로운 가능성들을 발견했습니다. 이는 제가 미래 교육에 대한 더 넓은 시야와 유연한 사고를 갖게 된 중요한 전환점이 되었습니다.",
    "links": []
  },
  {
    "year": "2017",
    "title": "공공과 민간의 경계에서 찾은 교육의 의미",
    "text": "사회적기업 아주건강한속삭임에서 팀장으로 활동하며 학교 밖 교육 연구와 프로그램 운영을 경험했습니다. 이후 맑음수학밝음국어 학원으로 전환하여 내신 및 수능 대비반을 담당하면서 국어 과목 전문성을 확보했습니다. 공공과 민간 영역의 경계에서 의미 있는 교육을 시도하며 교육의 폭과 깊이를 동시에 확장한 소중한 경험이었습니다.",
    "links": []
  },
  {
    "year": "2016",
    "title": "협력을 통한 교육 환경 개선의 경험",
    "text": "동료 교사들과의 긴밀한 협력을 통해 더 나은 교육 환경을 만들어가는 과정에 적극 참여했습니다. 이 과정에서 교사들 간의 유기적인 관계와 협력이 학생들의 성장에 얼마나 중요한 영향을 미치는지 체감했습니다. 개인의 역량도 중요하지만, 함께 만들어가는 교육 공동체의 힘이 더 크다는 것을 깨달은 의미 있는 시간이었습니다.",
    "links": []
  },
  {
    "year": "2015",
    "title": "대안교육 현장에서 찾은 확신",
    "text": "재단법인 청소년과사람사랑에서 팀장으로 성장하며 국어 수업과 생활지도를 병행했습니다. 대안교육 현장 초기의 불안감과 혼란 속에서도, 학생들과 함께 성장해나가는 과정에서 교육자로서의 확신을 얻었습니다. 이 경험은 제가 대안교육의 가치와 가능성을 깊이 이해하게 된 소중한 출발점이 되었습니다.",
    "links": []
  },
  {
    "year": "2014",
    "title": "경계선 청소년과의 만남, 교육과 상담의 통합적 접근",
    "text": "교육 현장에서 느린학습자(경계선 청소년)에 대한 이해를 높이며, 사회적 관심과 지원의 사각지대에 있는 학생들을 위한 맞춤형 교육의 필요성을 절실히 느꼈습니다. 또한 효과적인 교육을 위해서는 학생들의 심리적 안정과 정서적 지지가 필수적이라는 것을 깨달으며, 교육과 상담의 통합적 접근을 모색하기 시작했습니다.",
    "links": []
  },
  {
    "year": "2013",
    "title": "담임교사로서 배운 관계의 깊이",
    "text": "느린학습자(경계선 청소년)을 위한 위탁교육기관 사람사랑나눔학교에서 담임교사로 활동하며 학생들의 일상 깊숙이 들어가는 경험을 했습니다. 청소년지도사 자격을 준비하며 다양한 청소년을 만날 준비를 했지만, 실제로 경계선 청소년들과 만나는 것은 새로운 도전이자 깊은 배움의 과정이었습니다. 이 시기를 통해 교육이 단순한 기술이나 방법론이 아니라, 학생들과의 진정한 '관계' 속에서 이루어진다는 본질을 깨달았습니다.",
    "links": [
      {
        "label": "청소년지도사 자격증",
        "url": "./assets/2013/자격증_청소년지도사.pdf"
      }
    ]
  },
  {
    "year": "2012",
    "title": "진로 상담을 통한 삶의 길 안내",
    "text": "진로에 대한 깊은 고민과 성찰을 바탕으로, 청소년들 역시 더 복잡하고 어려운 진로 고민을 하고 있을 것이라 생각하여 직업상담사 자격을 취득했습니다. 교사라는 정체성을 넘어 다른 방식으로도 사람들의 삶을 도울 수 있는 가능성을 모색했습니다. 이는 제가 사람들의 성장과 발전을 돕는 방식에 대한 시야를 크게 넓혀준 경험이었습니다.",
    "links": [
      {
        "label": "직업상담사 자격증",
        "url": "./assets/2012/자격증_직업상담사.pdf"
      }
    ]
  },
  {
    "year": "2011",
    "title": "삶과 진로의 연결고리를 찾아서",
    "text": "이러닝 콘텐츠 설계자로 일하면서 '삶'과 '진로'라는 키워드에 깊은 관심을 갖게 되었습니다. 단순히 학습 내용을 전달하는 것을 넘어, 학습자의 삶 전체와 연결되는 교육의 가능성을 탐색했습니다. 이는 제가 교사라는 틀을 넘어 더 넓은 영역에서 사람들의 삶에 긍정적인 영향을 미치고 싶다는 비전을 키우는 계기가 되었습니다.",
    "links": []
  },
  {
    "year": "2010",
    "title": "교사로서의 준비 완성, 실천을 향한 출발",
    "text": "국어·도덕윤리 중등 정교사 자격을 취득하고 동국대학교를 졸업하며, 그동안 쌓아온 교육에 대한 이론적 토대가 실제 교육 현장에서의 실천으로 향하는 새로운 출발점에 섰습니다. 대학에서의 배움이 현실과 만나는 설렘과 긴장감을 동시에 느끼며, 진정한 교육자로 성장해나갈 준비를 마쳤습니다.",
    "links": [
      {
        "label": "졸업증명서",
        "url": "./assets/2010/졸업증명서.pdf"
      },
      {
        "label": "국어 교원자격증",
        "url": "./assets/2010/자격증_교원자격증(국어).pdf"
      },
      {
        "label": "도덕윤리 교원자격증",
        "url": "./assets/2010/자격증_교원자격증(도덕윤리).pdf"
      }
    ]
  },
  {
    "year": "2009",
    "title": "현장 경험과 성실함으로 다진 교육자의 기초",
    "text": "교육실습을 통해 교육 현장의 생생함을 처음으로 경험하며 '최우수' 평가를 받았습니다. 이론으로만 접했던 교육이 실제 학생들과 만나는 순간의 감동과 책임감을 깊이 느꼈습니다. 동시에 교내 근로장학과 국가근로장학, 광명시애향장학금 수혜를 통해 경제적 어려움 속에서도 학업과 실무 역량을 꾸준히 강화해나갔습니다. 성실함과 끈기가 교육자로서 갖춰야 할 기본 덕목임을 체득한 의미 있는 시기였습니다.",
    "links": [
      {
        "label": "교육실습일지 최우수",
        "url": "./assets/2009/수상_교육실습일지_최우수.pdf"
      },
      {
        "label": "광명애향장학증서",
        "url": "./assets/2009/장학_광명애향장학_장학증서.pdf"
      }
    ]
  },
  {
    "year": "2008",
    "title": "학업과 실무를 병행하며 쌓은 교육자의 소양",
    "text": "복학 후 학업에 매진하여 우수장학금을 수혜받으며 학업적 성취를 이루었습니다. 동시에 교내 근로장학 활동을 꾸준히 하며 학비 마련과 사회 경험을 병행했습니다. 선후배 간의 연결고리 역할을 하며 사범대학 내 '좋은교사경연대회'에 참가하여 '최우수' 성과를 거두기도 했습니다. 학업적 성장과 더불어 교육자로서 갖춰야 할 성실한 태도와 협력 정신을 기르는 소중한 기반을 마련한 시기였습니다.",
    "links": [
      {
        "label": "장학금 수혜확인서",
        "url": "./assets/2008/장학_장학금 수혜확인서.pdf"
      },
      {
        "label": "좋은교사되기 경연 수상",
        "url": "./assets/2008/수상_좋은교사경연대회_최우수.pdf"
      }
    ]
  },
  {
    "year": "2007",
    "title": "군 복무 후 새로운 시작, 사회적 실천의 경험",
    "text": "2월 군 복무를 마치고 3월에 동국대학교 국어교육과에 복학하며 학업을 재개했습니다. 복학과 함께 교내 근로장학 활동을 시작하여 학업과 사회 경험을 균형 있게 병행했습니다. 또한 성북시각장애인복지관에서 점자책 만들기 봉사활동(34시간)에 참여하며 사회에 기여하는 기쁨을 경험했습니다. 이는 훗날 교육자로서 갖춰야 할 사회적 책임감과 실천 정신을 기르는 값진 경험이었습니다.",
    "links": []
  },
  {
    "year": "2005",
    "title": "학업 성취와 군 복무, 성장을 위한 전환점",
    "text": "1학기에 우수장학금을 수혜받아 학업적 성취를 보였지만, 2월부터 군 복무를 시작하며 학업을 잠시 중단했습니다. 이는 저에게 삶의 중요한 전환점이자 내면을 깊이 성찰하는 시간이 되었습니다. 군 복무 기간 동안 다양한 사람들과의 만남을 통해 세상을 보는 시야를 넓히고, 훗날 교육자로서 가져야 할 포용력과 이해심을 기를 수 있었습니다.",
    "links": []
  },
  {
    "year": "2004",
    "title": "교육자로서의 첫 발걸음과 학업에 대한 의지",
    "text": "광명북고등학교를 졸업하고 동국대학교 국어교육과에 입학하며 교육자로서의 첫 발을 내디뎠습니다. 2학기에 학업지도교수 추천 장학금을 수혜받아 학업에 대한 의지를 다졌습니다. 아직은 막연했지만 '누군가의 삶에 의미 있게 닿는 일을 하고 싶다'는 열망만은 분명했습니다. 이 시기의 순수한 교육적 열정이 오늘날까지 저를 이끌어온 원동력이 되었습니다.",
    "links": []
  }
]