[
  {
    "year": "2025",
    "title": "Education Connected Through Stories, A Journey We Walk Together",
    "text": "2025 is my year of 'connection and sharing.' Through the webtoon 'Stories of Breath,' I share warm moments from educational settings through illustrations, and through the podcast 'Learning Together,' I bring teachers' sincere stories to the world. I'm deeply experiencing that education is not simply about delivering knowledge, but about sharing stories with each other and growing together. In line with this 'learning together,' I have directly built the 'Companion Guide for Slow Learners' website for teachers, parents, instructors, and volunteer leaders who have slow learning children and students, sharing balanced and in-depth understanding and practical support methods. Particularly while directly designing an after-school recording system, I'm building a sustainable educational ecosystem where teachers' precious efforts are accumulated as data and returned to benefit children. On the HamsungEdu Blog, I'm expressing the concerns I face in alternative education settings through essays, striving to make them shared insights that go beyond personal reflection.",
    "links": [
      {
        "label": "Proposal PDF",
        "url": "./assets/2025/함께걷는배움 기획.pdf"
      },
      {
        "label": "Afterschool Recording System",
        "url": "https://afterschool-slow.netlify.app"
      },
      {
        "label": "Promotion Process PDF",
        "url": "./assets/2025/홍보 프로세스.pdf"
      },
      {
        "label": "Sponsorship Network Operation PDF",
        "url": "./assets/2025/후원 네트워크 운영 프로세스.pdf"
      },
      {
        "label": "YouTube",
        "url": "https://youtube.com/channel/UCIIKHBAGoGkDf1zf4hfofew?si=_0ilOtCWZGfyl0lT"
      },
      {
        "label": "Instagram",
        "url": "https://www.instagram.com/hamsungedu"
      },
      {
        "label": "HamsungEdu Blog (Educational Essays)",
        "url": "httpshamsungedu.blogspot.com/"
      },
      {
        "label": "Companion Guide for Slow Learners",
        "url": "https://together-for-slow.netlify.app/"
      }
    ]
  },
  {
    "year": "2024",
    "title": "Educational Possibilities Viewed from a Broader World",
    "text": "Working as an educational researcher at Sesangium Co., Ltd., I'm gaining new dimensions of educational experience. Moving beyond the microscopic experience of meeting children in one classroom, I'm now designing educational platforms and developing tools that can be used in actual classes. The question 'How can more teachers have meaningful encounters with more children?' is being implemented into concrete results. Through this process, my educational philosophy has become clearer. Education is not the isolated effort of individuals but occurs within a collaborative ecosystem, and even a small tool can enrich someone's class - something I confirm every day.",
    "links": [
      {
        "label": "Economic Education Renewal",
        "url": "./assets/2024/경제교육 리뉴얼.pdf"
      },
      {
        "label": "Integrated Subject Class (Korean + Mind Study)",
        "url": "./assets/2024/교과통합수업(국어+마음공부).pdf"
      },
      {
        "label": "Alternative Teacher Training Program Results",
        "url": "./assets/2024/대안교사양성과정 결과.pdf"
      },
      {
        "label": "Teacher Agency Recovery",
        "url": "./assets/2024/대안교육 현장 속 교사들의 행위주체성 회복하기.pdf"
      }
    ]
  },
  {
    "year": "2023",
    "title": "Eyes That Read Hearts, Hands That Grow Together",
    "text": "Completing the Teachers' University for Life and obtaining clinical psychologist certification gave me important insights. I realized that a teacher's role doesn't simply end with conducting classes, but involves deeply understanding students' inner lives and growing together with them. While attempting integrated subject classes and creating economic education materials, I truly felt how important collaborative growth with fellow teachers is, rather than individual work. This year was a meaningful turning point where my educational perspective expanded from 'individual' centered to 'community' centered.",
    "links": [
      {
        "label": "Economic Textbook Staged Educational Content",
        "url": "./assets/2023/경제교재 단계별 교육내용.pdf"
      },
      {
        "label": "Integrated Subject Class (Korean + English)",
        "url": "./assets/2023/교과통합수업(국어+영어).pdf"
      },
      {
        "label": "Clinical Psychologist Level 2 Certificate",
        "url": "./assets/2023/자격증_임상심리사(2급).pdf"
      },
      {
        "label": "Becoming a Collaborative Instructor",
        "url": "./assets/2023/함께하는강사되기.pdf"
      }
    ]
  },
  {
    "year": "2022",
    "title": "Preparation for Going Deeper and Closer",
    "text": "My motivation for obtaining web design technician and slow learner cognitive counselor certifications was clear: the desire to 'understand more deeply and communicate more effectively.' I wanted to create tools that could actually implement ideas beyond just verbal explanations, and I wanted to truly understand the hearts of students struggling with learning. From this period, I began believing in and utilizing the power of 'practical tools' as an education practitioner.",
    "links": [
      {
        "label": "Slow Learner Qualification Registration Checklist",
        "url": "./assets/2022/기획_느린학습자(경계선) 관련 민간자격등록 점검사항.pdf"
      },
      {
        "label": "Slow Learner Counselor Certificate",
        "url": "./assets/2022/자격증_느린학습자(경계선) 인지학습 상담사.pdf"
      },
      {
        "label": "Web Design Technician Certificate",
        "url": "./assets/2022/자격증_웹디자인기능사.pdf"
      }
    ]
  },
  {
    "year": "2021",
    "title": "A Year of Seeking Direction and Discovering New Possibilities",
    "text": "While preparing for law school admission, I deeply contemplated the 'intersection of law and education.' Through the first-stage acceptance and interview experience, I had precious time to reflect on my career direction once again. Also, by planning a metaverse festival using Gather Town at the end of the year, I discovered new possibilities where technology and education could meet. This later led to my interest in educational innovation using digital tools.",
    "links": [
      {
        "label": "Gather Town Planning",
        "url": "./assets/2021/도전_게더타운.pdf"
      },
      {
        "label": "Law School Preparation Materials",
        "url": "./assets/2021/도전_로스쿨.pdf"
      }
    ]
  },
  {
    "year": "2020",
    "title": "Developing Textbooks and Teaching Materials for Life-Based Learning",
    "text": "In a situation where face-to-face activities were restricted due to COVID-19, I keenly realized the importance of educational materials. By directly creating textbooks and teaching materials that directly touch students' lives - from eating and washing to economic Monopoly games - I laid the foundation for realizing 'life-based learning.' This was the concrete implementation of my educational philosophy that education cannot be separated from real life.",
    "links": [
      {
        "label": "Textbook Research & Development: Eating & Washing",
        "url": "./assets/2020/01_교재연구개발_먹는일_씻는일.pdf"
      },
      {
        "label": "Teaching Material Development: Economic Awakening Monopoly",
        "url": "./assets/2020/02_교구개발_경제깨움 부루마블.pdf"
      }
    ]
  },
  {
    "year": "2019",
    "title": "Problem-Solving Skills Developed in Complex Reality",
    "text": "Facing the complex and multi-layered problems of educational settings, I developed practical problem-solving abilities. Beyond simply recognizing problems, I gained experience in finding realistic and sustainable solutions and actually applying them. The experiences of this period became the foundation for developing systematic thinking and practical approaches later on.",
    "links": []
  },
  {
    "year": "2018",
    "title": "Expansion of Educational Paradigms and New Perspectives",
    "text": "This was a year of exploring various educational models and approaches beyond existing educational methods. I discovered new possibilities such as learner-centered education and experience-based education, breaking away from traditional educational frameworks. This became an important turning point that gave me broader perspectives and flexible thinking about future education.",
    "links": []
  },
  {
    "year": "2017",
    "title": "Finding the Meaning of Education at the Boundary Between Public and Private",
    "text": "Working as a team leader at the social enterprise 'Very Healthy Whisper,' I experienced out-of-school education research and program management. Later, I transitioned to Maleum Math Balgeum Korean Academy, where I was in charge of classes for internal exams and college entrance exams, securing expertise in Korean language subjects. It was a precious experience of expanding both the breadth and depth of education while attempting meaningful education at the boundary between public and private sectors.",
    "links": []
  },
  {
    "year": "2016",
    "title": "Experience of Improving Educational Environment Through Cooperation",
    "text": "I actively participated in the process of creating a better educational environment through close cooperation with fellow teachers. Through this process, I experienced firsthand how important the organic relationships and cooperation among teachers are in influencing students' growth. I had meaningful time realizing that while individual capabilities are important, the power of an educational community created together is even greater.",
    "links": []
  },
  {
    "year": "2015",
    "title": "Conviction Found in Alternative Education Settings",
    "text": "Growing as a team leader at the Youth and People Love Foundation, I balanced Korean language classes with life guidance. Despite the initial anxiety and confusion in the early days of alternative education settings, I gained conviction as an educator through the process of growing together with students. This experience became a precious starting point for me to deeply understand the value and potential of alternative education.",
    "links": []
  },
  {
    "year": "2014",
    "title": "Meeting Borderline Youth: Integrated Approach of Education and Counseling",
    "text": "I enhanced my understanding of slow learners (borderline youth) in educational settings and keenly felt the need for customized education for students in the blind spots of social attention and support. I also realized that psychological stability and emotional support for students are essential for effective education, and began exploring an integrated approach between education and counseling.",
    "links": []
  },
  {
    "year": "2013",
    "title": "Learning the Depth of Relationships as a Homeroom Teacher",
    "text": "Working as a homeroom teacher at Sarang Nanum School, a commissioned educational institution for slow learners (borderline youth), I experienced going deep into students' daily lives. While I prepared to meet various youth by working toward youth counselor certification, actually meeting borderline youth was a new challenge and a process of deep learning. Through this period, I realized the essence that education is not simply a skill or methodology, but occurs within genuine 'relationships' with students.",
    "links": [
      {
        "label": "Youth Counselor Certificate",
        "url": "./assets/2013/자격증_청소년지도사.pdf"
      }
    ]
  },
  {
    "year": "2012",
    "title": "Guiding Life Paths Through Career Counseling",
    "text": "Based on deep contemplation and reflection on career paths, I thought that youth would also have more complex and difficult career concerns, so I obtained a career counselor certification. I explored the possibility of helping people's lives in different ways beyond the identity of being a teacher. This was an experience that greatly broadened my perspective on ways to help people's growth and development.",
    "links": [
      {
        "label": "Career Counselor Certificate",
        "url": "./assets/2012/자격증_직업상담사.pdf"
      }
    ]
  },
  {
    "year": "2011",
    "title": "Searching for the Connection Between Life and Career",
    "text": "Working as an e-learning content designer, I developed deep interest in the keywords 'life' and 'career.' Beyond simply delivering learning content, I explored the possibilities of education that connects with learners' entire lives. This became the catalyst for developing my vision to positively influence people's lives in broader areas beyond the framework of being a teacher.",
    "links": []
  },
  {
    "year": "2010",
    "title": "Completing Preparation as a Teacher, Starting Toward Practice",
    "text": "Obtaining secondary school teacher certification in Korean Language and Ethics, and graduating from Dongguk University, I stood at a new starting point where the theoretical foundation of education I had built would move toward practice in actual educational settings. Feeling both excitement and tension as university learning met reality, I completed my preparation to grow as a true educator.",
    "links": [
      {
        "label": "Graduation Certificate",
        "url": "./assets/2010/졸업증명서.pdf"
      },
      {
        "label": "Korean Language Teacher Certificate",
        "url": "./assets/2010/자격증_교원자격증(국어).pdf"
      },
      {
        "label": "Ethics Teacher Certificate",
        "url": "./assets/2010/자격증_교원자격증(도덕윤리).pdf"
      }
    ]
  },
  {
    "year": "2009",
    "title": "Foundation as an Educator Built Through Field Experience and Diligence",
    "text": "Through teaching practicum, I first experienced the vivid reality of educational settings and received an 'excellent' evaluation. I deeply felt the emotion and responsibility of the moment when education, which I had only encountered in theory, actually met with students. At the same time, through on-campus work-study programs, national work-study programs, and receiving the Gwangmyeong Hometown Scholarship, I steadily strengthened my academic and practical capabilities despite economic difficulties. This was a meaningful period where I embodied that diligence and perseverance are basic virtues that educators must possess.",
    "links": [
      {
        "label": "Teaching Practicum Journal - Excellent",
        "url": "./assets/2009/수상_교육실습일지_최우수.pdf"
      },
      {
        "label": "Gwangmyeong Hometown Scholarship Certificate",
        "url": "./assets/2009/장학_광명애향장학_장학증서.pdf"
      }
    ]
  },
  {
    "year": "2008",
    "title": "Educational Qualities Built While Balancing Studies and Practice",
    "text": "After returning to university, I devoted myself to studies and received excellence scholarships, achieving academic success. At the same time, I consistently engaged in on-campus work-study activities, balancing tuition funding with social experience. I also served as a connecting link between seniors and juniors, participating in the 'Good Teacher Competition' within the College of Education and achieving 'excellent' results. This was a period when I laid a precious foundation for developing the sincere attitude and cooperative spirit that I should have as an educator, along with academic growth.",
    "links": [
      {
        "label": "Scholarship Receipt Confirmation",
        "url": "./assets/2008/장학_장학금 수혜확인서.pdf"
      },
      {
        "label": "Good Teacher Competition Award - Excellent",
        "url": "./assets/2008/수상_좋은교사경연대회_최우수.pdf"
      }
    ]
  },
  {
    "year": "2007",
    "title": "New Beginning After Military Service, Experience of Social Practice",
    "text": "I completed military service in February and returned to Dongguk University's Korean Language Education Department in March, resuming my studies. Along with returning to university, I began on-campus work-study activities, balancing studies and social experience. I also participated in Braille book-making volunteer work (34 hours) at the Seongbuk Center for the Visually Impaired, experiencing the joy of contributing to society. This was a valuable experience that developed the social responsibility and spirit of practice that I should have as a future educator.",
    "links": []
  },
  {
    "year": "2005",
    "title": "Academic Achievement and Military Service: A Turning Point for Growth",
    "text": "I received excellence scholarships in the first semester, showing academic achievement, but started military service in February, temporarily suspending my studies. This became an important turning point in my life and a time for deep inner reflection. During military service, through meetings with various people, I was able to broaden my worldview and develop the inclusiveness and understanding that I should have as a future educator.",
    "links": []
  },
  {
    "year": "2004",
    "title": "First Steps as an Educator and Determination for Learning",
    "text": "Graduating from Gwangmyeong North High School and entering the Korean Language Education Department at Dongguk University, I took my first steps as an educator. In the second semester, I received a scholarship recommended by my academic advisor, strengthening my determination for learning. Although it was still vague, my aspiration to 'do work that meaningfully touches someone's life' was clear. The pure educational passion of this period became the driving force that has led me to this day.",
    "links": []
  }
]