[
  {
    "year": "2025",
    "title": "Structuring Educational Practices in Growth",
    "text": "For me, 2025 will be remembered not just for achieving goals, but as a year of 'structuring and implementing educational practices as a growing educator.' By planning the webtoon 'Breath Stories' and the podcast 'Walking with Learning,' I've deeply realized that education is not merely about transmitting knowledge, but about 'a process of sharing, discussing, and evolving together.' I am concretizing my vision for a sustainable educational ecosystem by directly designing an after-school recording system, which ensures teachers' efforts and practices are documented and reintegrated into the educational field. Furthermore, I am continually seeking growth as an educator by sharing my deep reflections and insights from the alternative education scene through essays on the 'HamsungEdu Blog'.",
    "links": [
      {
        "label": "Proposal PDF",
        "url": "./assets/2025/함께걷는배움 기획.pdf"
      },
      {
        "label": "Afterschool Recording System",
        "url": "https://afterschool-slow.netlify.app"
      },
      {
        "label": "Promotion Process.pdf",
        "url": "./assets/2025/홍보 프로세스.pdf"
      },
      {
        "label": "Sponsorship Network Operations.pdf",
        "url": "./assets/2025/후원 네트워크 운영 프로세스.pdf"
      },
      {
        "label": "YouTube",
        "url": "https://www.youtube.com/@hamsungedu"
      },
      {
        "label": "Instagram",
        "url": "https://www.instagram.com/hamsungedu"
      },
      {
        "label": "HamsungEdu Blog (Essays)",
        "url": "https://hamsungedu.blogspot.com/"
      }
    ]
  },
  {
    "year": "2024",
    "title": "Beginning Educational Research and Design",
    "text": "I started working as an educational researcher at 'Sesangieum,' a new educational organization. I am designing an educational practice platform and creating actual classroom-based tools, allowing me to design education from a broader perspective. At the same time, my own educational philosophy has become even clearer.",
    "links": [
      {
        "label": "Economics Education Renewal",
        "url": "./assets/2024/경제교육 리뉴얼.pdf"
      },
      {
        "label": "Integrated Subject Class (Korean+Mind Study)",
        "url": "./assets/2024/교과통합수업(국어+마음공부).pdf"
      },
      {
        "label": "Alternative Teacher Training Course Results",
        "url": "./assets/2024/대안교사양성과정 결과.pdf"
      },
      {
        "label": "Teacher Autonomy Recovery",
        "url": "./assets/2024/대안교육 현장 속 교사들의 행위주체성 회복하기.pdf"
      }
    ]
  },
  {
    "year": "2023",
    "title": "Inner Exploration and Collaborative Educational Practice",
    "text": "I participated in and completed the Teachers' College for Life, and obtained my clinical psychologist qualification. This was a period where I deeply realized that a teacher's role goes beyond just teaching, requiring observation of children's inner worlds. I also attempted integrated subject classes and economic education material creation, putting collaborative growth of teachers into practice.",
    "links": [
      {
        "label": "Economics Textbook Step-by-step Curriculum",
        "url": "./assets/2023/경제교재 단계별 교육내용.pdf"
      },
      {
        "label": "Integrated Subject Class (Korean+English)",
        "url": "./assets/2023/교과통합수업(국어+영어).pdf"
      },
      {
        "label": "Clinical Psychologist (Level 2) Certificate",
        "url": "./assets/2023/자격증_임상심리사(2급).pdf"
      },
      {
        "label": "Becoming a Collaborative Instructor",
        "url": "./assets/2023/함께하는강사되기.pdf"
      }
    ]
  },
  {
    "year": "2022",
    "title": "Enhancing Professionalism based on Activity Fields",
    "text": "I obtained qualifications as a Web Design Technician and a Cognitive Counselor for Slow Learners, driven by a desire to 'understand more deeply and communicate better.' As an educational practitioner, I began learning tools to enhance my capabilities beyond just verbal explanations.",
    "links": [
      {
        "label": "Slow Learner Qualification Registration Checklist",
        "url": "./assets/2022/기획_느린학습자(경계선) 관련 민간자격등록 점검사항.pdf"
      },
      {
        "label": "Slow Learner Counselor Certificate",
        "url": "./assets/2022/자격증_느린학습자(경계선) 인지학습 상담사.pdf"
      },
      {
        "label": "Web Design Technician Certificate",
        "url": "./assets/2022/자격증_웹디자인기능사.pdf"
      }
    ]
  },
  {
    "year": "2021",
    "title": "Career Transition, Intersection of Law and Education",
    "text": "While preparing for law school entrance exams, I deeply contemplated the intersection of 'law and education.' My experience passing the first stage and having an interview provided valuable time to reflect on my own direction. That year, by planning a metaverse festival using Gather Town, I also discovered the potential for technology and education to meet.",
    "links": [
      {
        "label": "Gather Town Planning",
        "url": "./assets/2021/도전_게더타운.pdf"
      },
      {
        "label": "Law School Preparation Materials",
        "url": "./assets/2021/도전_로스쿨/도전_로스쿨.pdf"
      }
    ]
  },
  {
    "year": "2020",
    "title": "Developing Materials and Tools for Learning in Life",
    "text": "From eating and washing to economic board games, I directly produced teaching materials and tools that connected to children's lives, laying the foundation for realizing 'learning in life.' This reflects my philosophy that education cannot be separated from real life.",
    "links": [
      {
        "label": "Curriculum Development: Eating_Washing",
        "url": "./assets/2020/01_교재연구개발_먹는일_씻는일.pdf"
      },
      {
        "label": "Tool Development: Economic Awakening Board Game",
        "url": "./assets/2020/02_교구개발_경제깨움 부루마블.pdf"
      }
    ]
  },
  {
    "year": "2019",
    "title": "Enhancing Problem-Solving Skills",
    "text": "Facing complex educational issues, I developed my problem-solving skills. I gained experience in not just recognizing problems, but also finding and applying practical solutions.",
    "links": []
  },
  {
    "year": "2018",
    "title": "Expanding Education, New Perspectives",
    "text": "I explored various educational models and approaches beyond traditional methods. This was a significant turning point that gave me a broader perspective on future education.",
    "links": []
  },
  {
    "year": "2017",
    "title": "Experiment as an Educational Researcher Outside School",
    "text": "As a team leader for 'Aju Healthy Whisper,' I gained experience in educational research and program operation outside the school system. This period involved attempting meaningful education at the boundary between public and private sectors, broadening my scope of education.",
    "links": []
  },
  {
    "year": "2016",
    "title": "Building a Collaborative Educational Environment",
    "text": "I strove to create a better educational environment through collaboration with other teachers. I realized that organic relationships with colleagues positively impact student growth.",
    "links": []
  },
  {
    "year": "2015",
    "title": "Alternative Education, Between Anxiety and Conviction",
    "text": "I took my first steps as a teacher at Saramsarang Nanum School and grew into a team leader for Youth and Saramsarang, balancing Korean language instruction and life guidance. Despite initial anxieties in the alternative education setting, I gained conviction in growing together with the children.",
    "links": []
  },
  {
    "year": "2014",
    "title": "Integration of Education and Counseling",
    "text": "During this period, I realized the importance of children's psychological stability and growth in the educational field, leading me to explore an integrated approach to education and counseling. This laid an important foundation for my future qualification as a clinical psychologist.",
    "links": []
  },
  {
    "year": "2013",
    "title": "Homeroom Teacher, Learning the Depth of Relationships",
    "text": "Working as a homeroom teacher at Saramsarang Nanum School, I became deeply involved in children's daily lives. This was a valuable period where I learned that guidance is not a mere technique, but stems from genuine 'relationships' with children.",
    "links": [
      {
        "label": "Youth Leader Certificate",
        "url": "./assets/2013/자격증_청소년지도사.pdf"
      }
    ]
  },
  {
    "year": "2012",
    "title": "Career Counseling, Assisting Life's Path",
    "text": "While working as a content designer, I became interested in the keywords 'life and career,' and obtained my career counselor qualification, exploring another possibility beyond being a teacher. This broadened my perspective on how to assist people's lives.",
    "links": [
      {
        "label": "Career Counselor Certificate",
        "url": "./assets/2012/자격증_직업상담사.pdf"
      }
    ]
  },
  {
    "year": "2011",
    "title": "Exploring the Link Between Life and Career",
    "text": "As a content designer, I developed a deep interest in the keywords 'life' and 'career.' This led to my desire to influence people's lives positively in a broader scope, beyond the traditional role of a teacher.",
    "links": []
  },
  {
    "year": "2010",
    "title": "Prepared Teacher, Stepping into the World",
    "text": "I obtained my secondary school teacher qualifications in Korean Language and Moral Ethics and graduated from Dongguk University. This was the first step where the theory of learning began to move towards practice, completing my preparation as an educator.",
    "links": [
      {
        "label": "Graduation Certificate",
        "url": "./assets/2010/졸업증명서.pdf"
      },
      {
        "label": "Korean Language Teacher Certificate",
        "url": "./assets/2010/자격증_교원자격증(국어).pdf"
      },
      {
        "label": "Moral Ethics Teacher Certificate",
        "url": "./assets/2010/자격증_교원자격증(도덕윤리).pdf"
      }
    ]
  },
  {
    "year": "2009",
    "title": "Teacher Competency Forged through Diligence",
    "text": "I worked for five semesters at the school library through a librarian work-study scholarship, learning the value of consistency, and received 'Excellent' evaluation during my teaching practicum, demonstrating my practical competence. This was a period where I realized that 'diligence' could be my strongest asset.",
    "links": [
      {
        "label": "Teaching Practicum Journal Excellent",
        "url": "./assets/2009/수상_교육실습일지_최우수.pdf"
      },
      {
        "label": "Gwangmyeong Ahyang Scholarship Certificate",
        "url": "./assets/2009/장학_광명애향장학_장학증서.pdf"
      }
    ]
  },
  {
    "year": "2008",
    "title": "First Steps in Teaching Practice",
    "text": "Through teaching practicum, I experienced the vivid reality of the classroom and learned to apply theory to practice by directly interacting with students. Receiving an 'Excellent' evaluation confirmed my capabilities as a teacher.",
    "links": []
  },
  {
    "year": "2007",
    "title": "Exploring the Essence of Education",
    "text": "During this period, I deeply explored the essence of education, establishing the direction I should pursue. I began to dream of education that goes beyond mere knowledge transfer, aiming to foster the holistic growth of children.",
    "links": []
  },
  {
    "year": "2006",
    "title": "Growth through Educational Volunteering",
    "text": "Through educational volunteering at a social welfare corporation, I experienced education in a real-world setting, moving beyond theoretical knowledge. Communicating with children, I felt the warmth of education and realized the reward of providing practical help.",
    "links": []
  },
  {
    "year": "2005",
    "title": "Cultivating Qualities of a Future Teacher",
    "text": "In a time when dreams were just beginning, I was recognized for my potential as a teacher by winning an award in the 'Good Teacher Competition.' Concurrently pursuing teaching courses and a double major deepened my understanding of education, establishing my attitude as a teacher during this period.",
    "links": [
      {
        "label": "Good Teacher Competition Award",
        "url": "./assets/2005/수상_좋은교사경연대회_최우수.pdf"
      }
    ]
  },
  {
    "year": "2004",
    "title": "First Encounter with Korean Language Education",
    "text": "After graduating from Gwangmyeongbuk High School, I entered Dongguk University, majoring in Korean Language Education, taking my first step as an educator. Although it was still vague, my desire to work in a field that touched people's lives was clear.",
    "links": []
  }
]